**DATA IMPORTING**

In [ ]:
# import packages
import os
import sys
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
import pickle;
import sas7bdat as sas
import h5py

In [ ]:
#data = pd.read_excel('employees_data.xlsx', index_col=0) # read Excel file to DataFrame object
data = pd.ExcelFile('employees_data.xlsx') # read Excel file to ExcelFile object

# data.head()
type(data)

# ExcelFile to DataFrame object
data = data.parse('Sheet1', index_col=0) # read the first sheet of the Excel file to DataFrame object
#or data = data.parse(0, index_col=0) # read the first sheet of the Excel file to DataFrame object
data.head(2)

    name  age  height gender         city  salary department
0  Alice   25     5.5      F     New York    5000         HR
1    Bob   35     6.0      M  Los Angeles    6000         IT

In [27]:
try:
    pd.read_csv('employees_data.csv', index_col=0)
    print("CSV file read successfully.")
except FileNotFoundError:
    print("File not found. Please check the file path and name.")

CSV file read successfully.

In [31]:
dict = {'Name': 'John', 'Age': 30, 'City': 'New York'} # create a dictionary
# convert dictionary to DataFrame object

dict.keys() # get the keys of the dictionary
dict.values() # get the values of the dictionary
dict.items() # get the items of the dictionary

dict_items([('Name', 'John'), ('Age', 30), ('City', 'New York')])

In [ ]:
# SQLite
from sqlalchemy import create_engine

# create sqlite database from DataFrame object
try:
    engine = create_engine('sqlite:///employees_data.db') # create SQLite engine
    data.to_sql('employees', engine, if_exists='replace', index=False) # write DataFrame to SQLite database
    print("DataFrame written to SQLite database successfully.")
except Exception as e:
    print(f"An error occurred: {e}")

DataFrame written to SQLite database successfully.

In [35]:
# Read SQLite data with Pandas

engine = create_engine('sqlite:///employees_data.db') # create SQLite engine
pd.read_sql_query('SELECT * FROM employees', engine) # read SQLite database to DataFrame object

      name  age  height gender          city  salary  department
0    Alice   25     5.5      F      New York    5000          HR
1      Bob   35     6.0      M   Los Angeles    6000          IT
2  Charlie   30     5.8      M       Chicago    7000     Finance
3    David   40     5.9      M       Houston    8000   Marketing
4      Eva   38     5.7      F       Phoenix    9000       Sales
5    Frank   43     6.1      M  Philadelphia   10000  Operations